doc/testMessages/saveDocument.v1/saveDocument.v1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xtee="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:adit="http://producers.ametlikud-dokumendid.xtee.riik.ee/producer/ametlikud-dokumendid">
   <soapenv:Header>
     <xtee:nimi>ametlikud-dokumendid.sendDocument.v1</xtee:nimi>
      <xtee:id>00000000000000</xtee:id>
      <xtee:isikukood>EE38407054916</xtee:isikukood>
      <xtee:andmekogu>ametlikud-dokumendid</xtee:andmekogu>
      <xtee:asutus>12345678</xtee:asutus>
      <adit:infosysteem>KOV</adit:infosysteem>
   </soapenv:Header>
   <soapenv:Body>
      <adit:SaveDocument>
        <keha>
	  	  <document href="cid:123123123"/>
		</keha>
      </adit:SaveDocument>
   </soapenv:Body>
</soapenv:Envelope>